ErpTest/src/InformationRegisters/ОсновныеСпецификации/ОсновныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновныеСпецификации</name>
  <resources>
    <name>МодельФормированияСтоимости</name>
    <type>
      <types>EnumRef.ТипыМоделейФормированияСтоимости</types>
    </type>
  </resources>
  <resources>
    <name>ПравилоРаспределения</name>
    <type>
      <types>CatalogRef.ПравилаРаспределенияРасходов</types>
    </type>
  </resources>
  <resources>
    <name>Спецификация</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </resources>
  <resources>
    <name>ОтражатьЗатратыДокументом</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ПолноеНаименованиеМодели</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТребуетсяНастройка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/ТипыМоделейФормированияСтоимости/ТипыМоделейФормированияСтоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыМоделейФормированияСтоимости</name>
  <enumValues>
    <name>ВыпускПоРассчитываемойСтоимости</name>
  </enumValues>
  <enumValues>
    <name>ВыпускПоФиксированнойСтоимости</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/InformationRegisters/ОсновныеСпецификации/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
	
	ЗаполнитьПолноеНаименованиеНастройки();

КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Прочее

Процедура ЗаполнитьПолноеНаименованиеНастройки()
	
	Для Каждого ТекЗапись Из ЭтотОбъект Цикл
		
		НаименованиеМодели = НСтр("ru = '<Настройки не заданы>'");
		
		ТребуетсяНастройка = Ложь;
		
		Если ТекЗапись.МодельФормированияСтоимости = Перечисления.ТипыМоделейФормированияСтоимости.ВыпускПоРассчитываемойСтоимости Тогда
			
			НаименованиеМодели = НСтр("ru = 'Выпуск продукции'");
			
		ИначеЕсли ТекЗапись.МодельФормированияСтоимости = Перечисления.ТипыМоделейФормированияСтоимости.ВыпускПоФиксированнойСтоимости Тогда
			
			НаименованиеМодели = НСтр("ru = 'Выпуск возвратных отходов'");
			
		Иначе
			
			ТребуетсяНастройка = Истина;
			
		КонецЕсли;
		
		ТекЗапись.ТребуетсяНастройка = ТребуетсяНастройка;
		ТекЗапись.ПолноеНаименованиеМодели = НаименованиеМодели;
		
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
